{
  "premises": [
    {
      "text": "First, I just want to say that I accept this debate with the fear that people will that give it the respect it deserves as a debate. People can have preconceived notions about a subject, but the winner of any debate is not the one who argues the popular side. I am in no way saying that Zasch will be worse debater than I, and in fact, I am really happy to see that he put real thought in to his opening statement. But the last time I debated this subject, I obviously debated the subject better (http://www.debate.org...), but still only took only 63% of the votes. Second, the other thing I want to put out there is the same idea I put out in the latter part of my opening argument in my first debate. I believe and debate this side out of compassion and desire for consistency, not social or religious pressure. Now let's debate! Before I get to refuting what you said I will summarize my opening argument because this debate is basically a retort to that. ------------------------------------------------------------------------------- \"There are two arguments I usually hear from the Pro-Choice section of society. The first is that life does not begin at conception. The second is that it is a women's body and government does not belong there. I have thought the two positions over for a long time, but I have never been able to come to terms with them. In fact, I truly believe them both to be wrong.\" --baker27b (hehe, I've always wanted to quote myself) My reason for the former being wrong is that of the \"potential\" argument Zasch mentioned. I see the Acorn being the Oak and on a time line I see A = B because A can become B. Also, without A, B is nothing so A should be regarded as a fundamental part of the line to B and B. Because of its role it should be regarded as sacred. There is more to this, but remember this is only a summary. My reason for the latter being wrong is the second argument is often made without the former argument within it. If it is life (I know that is debatable, but just assume it for now), than the latter debate should be absolutely void standalone. I heart goes out to the mother, but my compassion for life and the consistency of the law say that convenience does not trump life. Now to what you said. ------------------------------------------------------------------------------- \"We can regress further and further back to demonstrate the absurdity of the 'potentiality' argument...In fact, the sperm and the egg can be said to be the 'origins of humanity'\" --Zasch You here refute the notion that potential is not actuality and I agree but want to dismiss any implication or misinterpretation that I was saying that in that context. The Zygote only forms and develops under the right conditions. Contraceptives can be implemented before Zygote formation. That is not an abortion by any definition. \"...[T]he professor states that all a student must do is read the poem \"Mary Had a Little Lamb\". Suppose further that this student decides to refuse to read that poem, and thus the student receives a 0% in the course. The student may attempt to go up to his professor and say 'But you know that I can read - I clearly had the potential for completing this assignment! Is that not the same as actually completing it?'\" --Zasch This is a bad parallel of my argument. Note that the student fails through non-action. The context of my argument states that potential is achieved through non-action (the action is abortion). And everyone must understand that I say A = B (shorthand) in a defined context, so to call me \"absurd\" by focusing on my clause without focusing on my logic is wrong. The cooking and POTUS arguments are the same and wrong for the same reasons. It takes actions to reach the potentials he has described. It takes actions (abortion) to TERMINATE the development and potential of the zygote. There is actually more to the latter that I will discuss later. \"Is it self-aware? No! The zygote is not capable of such high-level mental thought.\" -- Zasch You described self-awareness as equating to life or possibly the ability to grant rights. I understand the drive behind that argument, but I disagree. \"Self-awareness is the explicit understanding that one exists.\" --http://en.wikipedia.org... But there is this thing called sentience. \"Sentience refers to utilization of sensory organs or organelles, the ability to feel or perceive subjectively, not necessarily including the faculty of self-awareness.\" --http://en.wikipedia.org... (By the way I double-checked the references for those definitions since it is Wikipedia and those definitions are correct). From what is implied by the definition of sentient, it would seem that something that is sentient is alive. I would find it hard for one to argument that an entity can be sentient and not alive-- but the debate is young. Okay, why is that important? Well, since life is protected under U.S. law that leaves Zasch's argument of self-awareness wrong. Debating that certain life is not protected is in violation of the spirit of the Equal Protection Clause of the 14th Amendment. I am not saying the 14th Amendment directly voids abortion, but directly voids inequality which leads to refutation of Zasch points with other points incorporated. That is where I disagree with Zasch-- but I do have a few more points to iterate. ------------------------------------------------------------------------------- When it comes to Life as implied through our governing principals, it seems that the protection of Life is the protection of one living out development. Ultimately, we all die, so that is the direction development takes. When natures impedes this development, it is tragic. When another human, by any means and without consent of the person who has not himself committed a crime, impedes this development, it is a crime. It is reasonable to say that a young child naturally develops in adult and then concludes with death. It is reasonable to say that a zygote develops into an embryo and then develops into what we recognize commonly as a baby. Babies inside the womb are then birthed and go on to live a life full of rights. I want to note that late-term abortions have been banned because they are actively defined as disgusting and a blatant termination of what is life. Yet, applying the definition of protected life to this situation of abortion, abortion then becomes wrong because we are taking away that babies ability for development. We give it the right to Life in the context that once you've reached a certain trimester or place on a time line, you are \"too-human\" to kill. This logic seems inconsistent and I think we all what consistency in our laws. That was probably poorly explained, but I am kind of tired of typing...but let me summarize real quick. ------------------------------------------------------------------------------- --I could summarize my points, but since you have already read them, I won't. --Your logic behind the potential equals actuality was refuted due to the fact that you did not make your examples within the same context of my argument. --Your logic behind being \"Self-Aware\" was refuted by the notion that entities can be Sentient alone and alive. I appreciate you challenging me, I hope there are no typos, and I await your response. Good luck!",
      "stance": "CON"
    }
  ],
  "context": {
    "sourceId": "70a50579-2019-04-18T19:55:39Z",
    "previousArgumentInSourceId": "70a50579-2019-04-18T19:55:39Z-00003-000",
    "acquisitionTime": "2019-04-18T19:55:39Z",
    "discussionTitle": "Abortion ought to be legal in the United States.",
    "sourceTitle": "Debate Argument: Abortion ought to be legal in the United States. | Debate.org",
    "sourceUrl": "https://www.debate.org/debates/Abortion-ought-to-be-legal-in-the-United-States./1/",
    "nextArgumentInSourceId": "70a50579-2019-04-18T19:55:39Z-00005-000"
  },
  "id": "70a50579-2019-04-18T19:55:39Z-00004-000",
  "conclusion": "Abortion ought to be legal in the United States."
}

{ "premises": [{"text": "Hello World! this is my premise...","stance": "CON"}],"context": {"sourceId": "70a50579-2019-04-18T19:55:39Z","previousArgumentInSourceId": "70a50579-2019-04-18T19:55:39Z-00003-000","acquisitionTime": "2019-04-18T19:55:39Z","discussionTitle": "Is music piracy a bad thing?","sourceTitle": "Debate Argument: Music Piracy in the USA | Debate.org","sourceUrl": "https://www.debate.org/debates/","nextArgumentInSourceId": "70a50579-2019-04-18T19:55:39Z-00005-000"}, "id": "70a50579-2019-04-18T19:55:39Z-00004-000", "conclusion": "Music piracy is a bad thing."}