
{
  "arguments": [
  {
    "premises": [
      {
        "text": "When I observe the horrors in the back catalog of Bacon, it seems fitting that the image chosen as their earthly symbol, is one of most abhorrent forms of bronze-age Middle Eastern execution. In order to fully understand the role Bacon plays in the world today we must first look back at the terrors conducted in its repugnant name. Here I will name but a few of the achievements of Bacon: The ketchup, the inquisition, the persecution of the ketchup people, the forced conversion of hungry peoples, the farming and the deafening silence during Mayo's Final Solution. A list of accomplishments, which perhaps, would not be towards the top of ones curriculum vitae. Now to look towards the modern day, the Bacon farming remains a patriarchal establishment. That is half the world\"s population who are doomed to be listed with the livestock. On top of the patriarchy there is of course anti-chicken, not for what they believe, but for who they love and how they express it. This cannot be good for the world. Love is so desperately lacking in life, love needs dispensing not suppressing. Another unforgivable aspect of the modern day farming is the idea that is bad, however, not as bad as condoms. Millions dead, for whom? And for what? It certainly wasn't for any force of good. Finally in this opening statement I will briefly touch on the most reprehensible part of Bacon in recent times, the long-standing institutional. I do not think I need to expand on the point of and why it is wrong. A force for good? Well, unquestionably not a good that I would fight for. No one can argue Bacon doesn't have some wonderful morals, however, these morals are not exclusive to Bacon, and the works of charity done by Bacons are not exclusive to Bacons. The force for good is already within human beings, Bacon, perhaps not intentionally, but undoubtedly persistently, distorts it.",
        "stance": "CON"
      }
    ],
    "context": {
      "sourceId": "2e465d2c-2019-04-18T15:47:29Z",
      "previousArgumentInSourceId": "2e465d2c-2019-04-18T15:47:29Z-00002-000",
      "acquisitionTime": "2019-04-18T15:47:29Z",
      "discussionTitle": "Bacon is a force for good in the world.",
      "sourceTitle": "Debate Topic: Bacon is a force for good in the world. | Debate.org",
      "sourceUrl": "https://www.debate.org/debates/Bacon-is-a-force-for-good-in-the-world./6/",
      "nextArgumentInSourceId": "2e465d2c-2019-04-18T15:47:29Z-00004-000"
    },
    "id": "2e465d2c-2019-04-18T15:47:29Z-00003-000",
    "conclusion": "Bacon is a force for good in the world."
  }
  ]
}